#languages - dont translate
en=en 
sk=sk
#Options enum translations
fight=bitka
visitArmoury=kupit brnenie
visitWeaponsShop=kupit zbrane
levelUp=vylepsit hrdinu
visitHome=ist domov
save=ulozit
menu=menu
help=napoveda
exit=odist
newGame=nova hra
load=nacitat
changeLanguage=zmena jazyka
attack=utok
defence=obrana
reflexes=reflexy
yes=ano
no=nie
seeWeapons=ukazat zbrane
seeArmour=ukazat brnenia
changeWeapon=zmena zbrane
changeArmour=zmena brnenia
strength=sila
hp=zivot
#normal lines translations
welcome=Vitaj v hre! S \u010Dím si praje\u0161 za\u010Da\u0165?
goodbye=Koniec.
mainMenu=Si v hlavnom menu
gameMenu=Si v hernom menu.\u0148n Aký bude tvoj \u010Fal\u0161í krok?
nextFightBoss=Pozor, tvoj \u010Fal\u013Eí protivník je Majster úrovne! Na túto bitku by si sa mal dobre pripravi\u0165!
endGameLine=Tak a je to. Si majster bojovník! V\u0161etky strá\u017Ee sa \u0165a boja a nechajú \u0165a len tak odkrá\u0165a\u0165 z mesta s tvojou milovanou. DOBRÁ PRÁCA!
scoreLine=Tvoje skóre bolo %d. Slu\u0161ná hra!\n
playerWon=Gratulujeme! Vyhral si boj. Získal si %d mincí a %d bodov skúseností!\n
getName=Ne\u017E sa vydá\u0161 na svoju neuverite\u013Enä cestu, musí\u0161 svojho hrdinu pomenova\u0165.\nZadaj jeho meno:
getSkillset=A teraz...ktorá je jeho najsilnej\u0161ia vlastnos\u0165? Utok, obrana, alebo reflexy?
heroCreated=Super! Teraz máme nového hrdinu. Jeho osud je len v tvojich rukách. Aký bude jeho prvý krok na ceste zachráni\u0165 svoju milovanú pani a tie\u017E svoj vlastný \u017Eivot?
saveQuestion=Ulo\u017Eenie hry vyma\u017Ee momentálne ulo\u017Eenú hru (ak nejaká ulo\u017Eená ja). Praje\u0161 si pokra\u010Dova\u0165?
gameNotSaved=Tvoja hra nebola ulo\u017Eená.  
gameSaved=Tvoj hrdina je bezpe\u010Dne ulo\u017Eený!
saveFailed=Tvoj hrdina nechce by\u0165 ulo\u017Eený. Skús to znova, mo\u017Eno ho presved\u010Dí\u0161!
successfulLoad=Tvoj hrdina sa prebudil a je pripravený znova bojova\u0165!
loadFailed=Vy\u0161\u0161ia moc sa rozhodla, \u017Ee ti nedovolia na\u010Díta\u0165 hru. Skús to znova, mo\u017Eno sa ti po\u0161\u0165astí!
loadFailedClassNotFound=Tvoj hrdina sa niekde skrýva a nevieme ho nájs\u0165. Skús to znova, aby si zvý\u0161il \u0161ancu, \u017Ee ho nájdeme!
availableLanguages=Dostupné jazyky sú:\n
languageChanged=Jazyk bol zmenený. Zmeny sa uká\u017Eu pri \u010Fal\u0161om spustení hry.
fightIntro=Toto bude \u0165a\u017Eká bitka.
heroFightInfo=Nejaké informácie o tebe: %s, útok: %d, obrana: %d, \u017Eivot: %d, zbra\u0148: %s, brnenie: %s, %s\n
opponentFightInfo=Nie\u010Do o tvojom súperovi: %s, útok: %d, obrana: %d, \u017Eivot: %d, zbra\u0148: %s, brnenie: %s, %s\n
playerStartsBattle=Za\u010Dína\u0161 boj. \u010Co urobí\u0161?
opponentStartsBattle=Tvoj súper za\u010Dína.
playerHP=Tvoj zostávajúci \u017Eivot je: %d.\n
opponentHP=Zostávajúci \u017Eivot tvojho súpera: %d.\n
playerTurn=Ide tvoj súper.
opponentTurn=\u0164ah tvojho súpera.
playerWin=Tvoj súper náhle skolaboval. Vyhral si!
opponentWin=Nedokázal si porazi\u0165 svojho súpera a zomrel si. Aká tragédia! Koniec hry, tvoje skóre bolo: %d. DOBRÁ HRA!
arenaError=Aréna je plná. Skús neskôr.
bareHandsOptions=Bojuje\u0161 s holými rukami. Má\u0161 na výber iba 2 mo\u017Enosti: facka a úder.
weaponOptions=Si na \u0165ahu. Ako chce\u0161 zaúto\u010Di\u0165?
playerSlashFail=Tvoje seknutie bolo a\u017E príli\u0161 slabé a súper sa dokázal s preh\u013Eadom ubráni\u0165...
opponentSlashFail=Tvoj súper sa \u0165a pokúsil seknú\u0165, ale nemal \u017Eiadnu \u013Eancu!
playerSlashHit=WOW! Tomuto sa hovorí seknutie. Tvoj súper bol vá\u017Ene ranený!!
opponentSlashHit=Tvoj súper \u0165a dosekal ako salámu. Au!
playerStabFail=Síce si sa pokúsil seknú\u0165 svojho súpera, no aj tvoja babka by to spravila lep\u0161ie!
opponentStabFail=%s sa \u0165a pokúsil bodnú\u0165, ale bol si dostato\u010Dne rýchly, aby si odrazil jeho útok!\n
playerStabHit=\u02C7ANO! Tvoje bodnutie bolo ve\u013Emi efektívne a tvoj súper bol riadne zranený!!
opponentStabHit=Tvoj súper \u0165a bodol a zanechal na tebe vá\u017Ene zranenia. Toto sa bude dlho hoji\u0165.
playerThrowFail=Pokúsil si sa po súperovi hodi\u0165 svoju zbra\u0148, no bol to skôr taký babský hod. Súpera si neranil ani omylom a zostali ti u\u017E len holé ruky na dokon\u010Denie bitky.
opponentThrowFail=Zúfalé situácie si vy\u017Eadujú zúfalé \u010Diny. Tvoj súper sa pokúsil hodi\u0165 svoju zbra\u0148, ale ako mô\u017Ee takýto sedliak rani\u0165 takého bojovníka, akým je tvoj hrdina??
playerThrowHit=TO BOL ALE HOD! Napriek tomu, \u017Ee ti ostali u\u017E len holé ruky, sa ti podarilo zasiahnú\u0165 tvojho súpera a nevyzerá to s ním vôbec dobre. Paráda!
opponentThrowHit=Napriek tomu, \u017Ee ledva \u017Eije, tvoj súper dokázal nazbiera\u0165 silu, aby po tebe hodil svoju zbra\u0148 a zasiahol \u0165a. Toto bolo od teba ve\u013Emi slabé bránenie...
stabChance=\u0161anca na bodnutie: 
slashChance=%, \u0161anca na seknutie: 
throwChance=%, \u0161anca pri hode zbrane: 
armouryWelcome=Vitaj v zbrojnici!
armouryOffer=Tu je na\u0161a ponuka brnení, ktoré e\u0161te nevlastní\u0161:
armouryOption=Mo\u017Enos\u0165 %s: %s, %s min\u010cí. Obrana: %s, Hmotnos\u0165: %s, Popis: %s\n
armouryPrompt=Praje\u0161 si nie\u010Do kúpi\u0165, alebo chce\u0161 odís\u0165? Momentálne má\u0161 %d mincí.\n
armouryPurchase=Úspe\u0161ne si si kúpil nové brnenie! Teraz má\u0161 %d mincí.
armouryNotEnoughMoney=Na toto brnenie nemá\u0161 dostatok mincí. Skús nie\u010Do iné!
weaponShopWelcome=Vitaj v obchode so zbra\u0148ami! 
weaponShopOffer=Tu je na\u0161a ponuka zbraní, ktoré e\u0161te nevlastní\u0161:
weaponShopOption=Mo\u017Enos\u0165 %s: %s, %s min\u010cí. Útok: %s, Hmotnos\u0165: %s, Popis: %s\n
weaponShopPrompt=Chce\u0161 si nie\u010Do kúpi\u0165, alebo odís\u0165? Momentálne má\u0161 %d mincí.\n
weaponShopPurchase=Úspe\u0161ne si si kúpil novú zbra\u0148! Teraz má\u0161 %d mincí. \n
weaponShopNotEnoughMoney=Nemá\u010D dostatok mincí na túto zbra\u0148!\n
weaponShopNextPrompt=Chce\u0161 e\u0161te nakupova\u0165?
homeWelcome=Vitaj doma!
homePrompt1=\u010Co chce\u0161 robi\u0165?
homeWeaponList=Mo\u017Enos\u0165 %s, %s, Útok: %s, Hmotnos\u0165: %s, Popis: %s\n
homeArmourList=Mo\u017Enos\u0165 %s: %s, Obrana: %s, Hmotnos\u0165: %s, Popis: %s\n
homeWeapons=Tvoje zbrane: %s
homeWeaponChoice=Ktorú zbra\u0148 chce\u0161 pou\u017Eíva\u0165?
homeWeaponChosen=Od teraz pou\u017Eíva\u0161 %s.\n
homeArmours=Tvoje brnenia: %s
homeArmourChoice=Ktoré brnenie chce\u0161 so sebou nosi\u0165?
homeArmourChosen=Od teraz so sebou bude\u0161 nosi\u0165 %s.\n
trainingWelcome=Vitaj v tréningovej aréne! Tu mô\u017Ee\u0161 pou\u017Ei\u0165 svoje body skúseností aby si zlep\u0161il svoje bojové schopnosti.
trainingXP=Má\u0161 k dizpozícii %d bodov skúseností.\n
trainingAttack=Tvoj level útoku je %d a \u010Fal\u0161í level \u0165a bude stá\u0165 %d bodov.\n
trainingDefence=Tvoj level obrany je %d a \u010Fal\u0161í level \u0165a bude stá\u0165 %d bodov.\n
trainingReflexes=Tvoje reflexy sú na úrovni %d a \u010Fal\u0161í level \u0165a bude stá\u0165 %d bodov.\n
trainingStrength=Tvoja sila je na úrovni %d a \u010Fal\u0161í level \u0165a bude stá\u0165 %d bodov.\n
trainingHP=Maximum tovjho \u017Eivota je %d a zvý\u0161i\u0165 ho mô\u017Ee\u0161 za %d bodov.\n
trainingPrompt=\u010Co chce\u0161 robi\u0165 teraz?
trainingUpgrade=Tvoje schopnosti boli úspe\u0161ne vylep\u0161ené!
trainingNotEnoughXP=Na toto nemá\u0161 dostatok bodov skúseností!
inputOptions=Tvoje mo\u017Enosti sú: %s.\n
inputInvalidCommand=Neplatná vo\u013Eba!
punch=uder
slap=facka
stab=bodnutie
slash=seknutie
throwWeapon=hod zbrane
paper=It is a paper. Does not really provide any defence, but it looks like a shield!
carton=A lightweight armour, which can protect you a little bit. Very light!
shield=A wooden shield is very solid. Not the ultimate solution, but affordable!
iron=A heavy-weight armour that will make you immortal. You cannot get killed in this one...unless you get killed.
steel=A stronger and lighter version of the iron armour. This is a real warrior's choice.
hands=Your hands, take it or leave it
toothpick=A solid wooden toothpick handmade by the golden arms of Soviet workers
arrow=Who needs a bow? Slash, stab or throw? Always lethal. A great option!
anvil=Iron is always painful. An anvil-shaped boxer? You always want to avoid it. Ouch!
hammer=This may not be the lightest weapon ever made. Used by the Vikings, it is now made in XS size for ordinary warriors.
spear=A broken spear is basically just a stick. However, if you use some of your creativity, you will be unbeatable!
boomerangA good friend always returns, right? So does your boomerang. Lame slash, lame stab, but unlimited throws! Imagine the opportunities...
spoon=Nobody wants to mess with this. Some warriors run away just after seeing your weapon of destruction. Use wisely, can cause great injuries.