#languages - dont translate
en=en
sk=sk
#Options enum translations
fight=bitka
visitArmoury=kupit brnenie
visitWeaponsShop=kupit zbrane
levelUp=vylepsit hrdinu
visitHome=ist domov
save=ulozit
menu=menu
help=napoveda
exit=odist
newGame=nova hra
load=nacitat
changeLanguage=zmena jazyka
attack=utok
defence=obrana
reflexes=reflexy
yes=ano
no=nie
seeWeapons=ukazat zbrane
seeArmour=ukazat brnenia
changeWeapon=zmena zbrane
changeArmour=zmena brnenia
strength=sila
hp=zivot
#normal lines translations
introText=Kde bolo tam bolo, v \u010dasoch, ke\u010f e\u0161e neboli \u017eiadne aut\u00e1, \u017eiadn\u00e9 technologick\u00e9 vymo\u017eenosti a azda aj Slnko bolo jasnej\u0161ie, bolo jedno mal\u00e9 kr\u00e1\u013eovstvo naz\u00fdvan\u00e9 Absurdia. Nikto presne nevie kde sa nach\u00e1dza, alebo ako sa tam dosta\u0165. Jedin\u00e9, \u010do je v na\u0161ich schopnostiach, je komunikova\u0165 s n\u00edm pomocou tejto pr\u00edkazovej riadky. \u010co v\u0161ak o tomto kr\u00e1\u013eovstve vieme je, \u017ee tam \u017eije n\u00e1dhern\u00e1 princezn\u00e1 uv\u00e4znen\u00e1 v najvy\u0161\u0161ej ve\u017ei patriacej kr\u00e1\u013eovi Absurdie. Toto v\u0161ak nie je hocijak\u00e1 princezn\u00e1. Ide o princezn\u00fa tak n\u00e1dhern\u00fa, \u017ee sa o jej kr\u00e1se \u0161epk\u00e1 e\u0161te aj v susedn\u00fdch kr\u00e1\u013eovstv\u00e1ch. Av\u0161ak kr\u00e1\u013e pris\u013e\u00fabil, \u017ee ju nech\u00e1 od\u00eds\u0165 s mu\u017eom, ktor\u00fd dok\u00e1\u017ee vydr\u017ea\u0165 3 dni v jeho bojovej ar\u00e9ne plnej krvila\u010dn\u00fdch bojovn\u00edkov \u010dakaj\u00facich na moment, ke\u010f ich bezmocn\u00ed protivn\u00edci vst\u00fapia do ringu. Na\u0161iel sa v\u0161ak jeden chlap, ktor\u00fd je tak stato\u010dn\u00fd, \u017ee sa podujal sk\u00fasi\u0165 t\u00fato v\u00fdzvu zvl\u00e1dnu\u0165 a zachr\u00e1ni\u0165 jeho \u010doskoro milovan\u00fa princezn\u00fa z ve\u017ee. Av\u0161ak na to, aby to dok\u00e1zal, potrebuje tvoju pomoc. Si jedin\u00fd, kto mu dok\u00e1\u017ee pom\u00f4c\u0165 s naplnen\u00edm jeho snov. Dok\u00e1\u017ee\u0161 mu na tejto epickej ceste pom\u00f4c\u0165?
controlsInfo=Ovl\u00e1danie je jednoduch\u00e9. \u010c\u00edtaj \u010do ti hovor\u00ed pr\u00edkazov\u00e1 riadka a z pr\u00edpadn\u00fdch mo\u017enost\u00ed vyberaj v\u017edy len 1 mo\u017enos\u0165, odpovede p\u00ed\u0161 mal\u00fdmi p\u00edsmenami bez diakritiky a potvrdzuj tla\u010didlom Enter. Ve\u013ea \u0161\u0165astia!
welcome=Vitaj v hre! S \u010d\u00edm si praje\u0161 za\u010da\u0165?
goodbye=Koniec.
mainMenu=Si v hlavnom menu.
gameMenu=Si v hernom menu.\nAk\u00fd bude tvoj \u010fal\u0161\u00ed krok?
nextFightBoss=Pozor, tvoj \u010fal\u0161\u00ed protivn\u00edk je Majster \u00farovne! Na t\u00fato bitku by si sa mal dobre pripravi\u0165!
endGameLine=Tak a je to. Si majster bojovn\u00edk! V\u0161etky str\u00e1\u017ee sa \u0165a boja a nechaj\u00ed \u0165a len tak odkr\u00e1\u010da\u0165 z mesta s tvojou milovanou. DOBR\u00c1 PR\u00c1CA!
scoreLine=Tvoje sk\u00f3re bolo %d. Slu\u0161n\u00e1 hra!\n
playerWon=Gratulujeme! Vyhral si boj. Z\u00edskal si %d minc\u00ed a %d bodov sk\u00fasenost\u00ed!\n
getName=Ne\u017e sa vyd\u00e1\u0161 na svoju neuverite\u013en\u00fa cestu, mus\u00ed\u0161 svojho hrdinu pomenova\u0165.\nZadaj jeho meno:
getSkillset=A teraz...ktor\u00e1 je jeho najsilnej\u0161ia vlastnos\u0165? \u00datok, obrana, alebo reflexy?
heroCreated=Super! Teraz m\u00e1me nov\u00e9ho hrdinu. Jeho osud je len v tvojich ruk\u00e1ch. Ak\u00fd bude jeho prv\u00fd krok na ceste zachr\u00e1ni\u0165 svoju milovan\u00fa pani a tie\u017e svoj vlastn\u00fd \u017eivot?
saveQuestion=Ulo\u017eenie hry vyma\u017ee moment\u00e1lne ulo\u017een\u00fa hru (ak nejak\u00e1 ulo\u017een\u00e1 je). Praje\u0161 si pokra\u010dova\u0165?
gameNotSaved=Tvoja hra nebola ulo\u017een\u00e1.
gameSaved=Tvoj hrdina je bezpe\u010dne ulo\u017een\u00fd!
saveFailed=Tvoj hrdina nechce by\u0165 ulo\u017een\u00fd. Sk\u00fas to znova, mo\u017eno ho presved\u010d\u00ed\u0161!
successfulLoad=Tvoj hrdina sa prebudil a je pripraven\u00fd znova bojova\u0165!
loadFailed=Vy\u0161\u0161ia moc sa rozhodla, \u017ee ti nedovolia na\u010d\u00edta\u0165 hru. Sk\u00fas to znova, mo\u017eno sa ti po\u0161\u0165ast\u00ed!
loadFailedClassNotFound=Tvoj hrdina sa niekde skr\u00fdva a nevieme ho n\u00e1js\u0165. Sk\u00fas to znova, aby si zv\u00fd\u0161il \u0161ancu, \u017ee ho n\u00e1jdeme!
availableLanguages=Dostupn\u00e9 jazyky s\u00fa:\n
languageChanged=Jazyk bol zmenen\u00fd. Zmeny sa uk\u00e1\u017eu pri \u010fal\u0161om spusten\u00ed hry.
fightIntro=Toto bude \u0165a\u017ek\u00e1 bitka.
heroFightInfo=Nejak\u00e9 inform\u00e1cie o tebe: %s, \u00fatok: %d, obrana: %d, \u017eivot: %d, zbra\u0148: %s, brnenie: %s, %s\n
opponentFightInfo=Nie\u010do o tvojom s\u00faperovi: %s, \u00fatok: %d, obrana: %d, \u017eivot: %d, zbra\u0148: %s, brnenie: %s, %s\n
playerStartsBattle=Za\u010d\u00edna\u0161 boj. \u010co urob\u00ed\u0161?
opponentStartsBattle=Tvoj s\u00faper za\u010d\u00edna.
playerHP=Tvoj zost\u00e1vaj\u00faci \u017eivot je: %d.\n
opponentHP=Zost\u00e1vaj\u00faci \u017eivot tvojho s\u00fapera: %d.\n
playerTurn=Si na \u0165ahu.
opponentTurn=\u0164ah tvojho s\u00fapera.
playerWin=Tvoj s\u00faper n\u00e1hle skolaboval. Vyhral si!
opponentWin=Nedok\u00e1zal si porazi\u0165 svojho s\u00fapera a zomrel si. Ak\u00e1 trag\u00e9dia! Koniec hry, tvoje sk\u00f3re bolo: %d. DOBR\u00c1 HRA!
arenaError=Ar\u00e9na je pln\u00e1. Sk\u00fas nesk\u00f4r.
bareHandsOptions=Bojuje\u0161 s hol\u00fdmi rukami. M\u00e1\u0161 na v\u00fdber iba 2 mo\u017enosti: facka a \u00fader.
weaponOptions=Si na \u0165ahu. Ako chce\u0161 za\u00fato\u010di\u0165?
playerSlashFail=Tvoje seknutie bolo a\u017e pr\u00edli\u0161 slab\u00e9 a s\u00faper sa dok\u00e1zal s preh\u013eadom ubr\u00e1ni\u0165...
opponentSlashFail=Tvoj s\u00faper sa \u0165a pok\u00fasil sekn\u00fa\u0165, ale nemal \u017eiadnu \u0161ancu!
playerSlashHit=WOW! Tomuto sa hovor\u00ed seknutie. Tvoj s\u00faper bol v\u00e1\u017ene ranen\u00fd!!
opponentSlashHit=Tvoj s\u00faper \u0165a dosekal ako sal\u00e1mu. Au!
playerStabFail=S\u00edce si sa pok\u00fasil bodn\u00fa\u0165 svojho s\u00fapera, no aj tvoja babka by to spravila lep\u0161ie!
opponentStabFail=%s sa \u0165a pok\u00fasil bodn\u00fa\u0165, ale bol si dostato\u010dne r\u00fdchly na to, aby si odrazil jeho \u00fatok!\n
playerStabHit=\u00c1NO! Tvoje bodnutie bolo ve\u013emi efekt\u00edvne a tvoj s\u00faper bol riadne zranen\u00fd!!
opponentStabHit=Tvoj s\u00faper \u0165a bodol a zanechal na tebe v\u00e1\u017ene zranenia. Toto sa bude dlho hoji\u0165.
playerThrowFail=Pok\u00fasil si sa po s\u00faperovi hodi\u0165 svoju zbra\u0148, no bol to sk\u00f4r tak\u00fd babsk\u00fd hod. S\u00fapera si neranil ani omylom a zostali ti u\u017e len hol\u00e9 ruky na dokon\u010denie bitky.
opponentThrowFail=Z\u00fafal\u00e9 situ\u00e1cie si vy\u017eaduj\u00fa z\u00fafal\u00e9 \u010diny. Tvoj s\u00faper sa pok\u00fasil hodi\u0165 svoju zbra\u0148, ale ako m\u00f4\u017ee tak\u00fdto sedliak rani\u0165 tak\u00e9ho bojovn\u00edka, ak\u00fdm je tvoj hrdina??
playerThrowHit=TO BOL ALE HOD! Napriek tomu, \u017ee ti ostali u\u017e len hol\u00e9 ruky, sa ti podarilo zasiahn\u00fa\u0165 tvojho s\u00fapera a nevyzer\u00e1 to s n\u00edm v\u00f4bec dobre. Par\u00e1da!
opponentThrowHit=Napriek tomu, \u017ee ledva \u017eije, tvoj s\u00faper dok\u00e1zal nazbiera\u0165 silu, aby po tebe hodil svoju zbra\u0148 a zasiahol \u0165a. Toto bolo od teba ve\u013emi slab\u00e9 br\u00e1nenie...
playerSlapFail=Tvoj hrdina by sa mal nau\u010di\u0165 fackova\u0165 od svojej b\u00fdvalej...toto nesiahalo ani po p\u00e4ty jej grandi\u00f3znym fack\u00e1m!
opponentSlapFail=Nie je jasn\u00e9, \u010di sa tvoj opoponent sna\u017eil da\u0165 facku tvojmu hrdinovi, alebo sa len zah\u00e1\u0148al po muche. Nemal ani len \u0161ancu udrie\u0165 tvojho hrdinu...
playerSlapHit=T\u00e1to sadla prekr\u00e1sne! Na s\u00faperovom l\u00edci sa vyn\u00edma odtla\u010dok dlane tvojho hrdinu. Au!
opponentSlapHit=Ak tvoj s\u00faper neprestane s tak\u00fdmito kvalitn\u00fdmi fackami, tak tvoj hrdina na tomto svete dlho nepob\u00eddne. R\u00fdchlo, vr\u00e1\u0165 mu po\u017ei\u010dan\u00e9!
playerPunchFail=Rozd\u00e1va\u0165 \u00fadery ako t\u00e1to...proste bez koment\u00e1ra. Tvojmu hrdinovi sa u\u017e asi nechce...
opponentPunchFail=Ak sa tvoj s\u00faper nevzchop\u00ed, nebude probl\u00e9m ho zdola\u0165. Jeho rana bola kvalitn\u00e1 ako za 5 kor\u00fan no\u017e\u00edk. 
playerPunchHit=Brav\u00f3, tvoj hrdina sa bije ako prav\u00fd opilec! Tvoj s\u00edper sa skr\u00faca v bolestiach. Pekn\u00e1 rana!
opponentPunchHit=\u00dader tvojho s\u00fapera bol ne\u010dakan\u00fd a hrdina stratil nieko\u013eko zubov. Toto nevyzer\u00e1 v\u00f4bec dobre...
stabChance=\u0161anca na bodnutie: 
slashChance=%, \u0161anca na seknutie: 
throwChance=%, \u0161anca pri hode zbrane: 
armouryWelcome=Vitaj v zbrojnici!
armouryOffer=Tu je na\u0161a ponuka brnen\u00ed, ktor\u00e9 e\u0161te nevlastn\u00ed\u0161:
armouryOption=Mo\u017enos\u0165 %s: %s, %s minc\u00ed. Obrana: %s, Hmotnos\u0165: %s, Popis: %s\n
armouryPrompt=Praje\u0161 si nie\u010do k\u00fapi\u0165, alebo chce\u0161 od\u00eds\u0165? Moment\u00e1lne m\u00e1\u0161 %d minc\u00ed.\n
armouryPurchase=\u00daspe\u0161ne si si k\u00fapil nov\u00e9 brnenie! Teraz m\u00e1\u0161 %d minc\u00ed.\n
armouryNotEnoughMoney=Na toto brnenie nem\u00e1\u0161 dostatok minc\u00ed. Sk\u00fas nie\u010do in\u00e9!
weaponShopWelcome=Vitaj v obchode so zbra\u0148ami! 
weaponShopOffer=Tu je na\u0161a ponuka zbran\u00ed, ktor\u00e9 e\u0161te nevlastn\u00ed\u0161:
weaponShopOption=Mo\u017enos\u0165 %s: %s, %s minc\u00ed. \u00datok: %s, Hmotnos\u0165: %s, Popis: %s\n
weaponShopPrompt=Chce\u0161 si nie\u010do k\u00fapi\u0165, alebo od\u00eds\u0165? Moment\u00e1lne m\u00e1\u0161 %d minc\u00ed.\n
weaponShopPurchase=\u00daspe\u0161ne si si k\u00fapil nov\u00fa zbra\u0148! Teraz m\u00e1\u0161 %d minc\u00ed. \n
weaponShopNotEnoughMoney=Nem\u00e1\u0161 dostatok minc\u00ed na t\u00fato zbra\u0148!\n
weaponShopNextPrompt=Chce\u0161 e\u0161te nakupova\u0165?
homeWelcome=Vitaj doma!
homePrompt1=\u010co chce\u0161 robi\u0165?
homeWeaponList=Mo\u017enos\u0165 %s: %s, \u00datok: %s, Hmotnos\u0165: %s, Popis: %s\n
homeArmourList=Mo\u017enos\u0165 %s: %s, Obrana: %s, Hmotnos\u0165: %s, Popis: %s\n
homeWeapons=Tvoje zbrane: %s
homeWeaponChoice=Ktor\u00fa zbra\u0148 chce\u0161 pou\u017e\u00edva\u0165?
homeWeaponChosen=Od teraz pou\u017e\u00edva\u0161 %s.\n
homeArmours=Tvoje brnenia: %s\n
homeArmourChoice=Ktor\u00e9 brnenie chce\u0161 so sebou nosi\u0165?
homeArmourChosen=Od teraz so sebou bude\u0161 nosi\u0165 %s.\n
trainingWelcome=Vitaj v tr\u00e9ningovej ar\u00e9ne! Tu m\u00f4\u017ee\u0161 pou\u017ei\u0165 svoje body sk\u00fasenosti, aby si zlep\u0161il bojov\u00e9 schopnosti svojho hrdinu.
trainingXP=M\u00e1\u0161 k dizpoz\u00edcii %d bodov sk\u00fasenost\u00ed.\n
trainingAttack=Tvoj level \u00fatoku je %d a \u010fal\u0161\u00ed level \u0165a bude st\u00e1\u0165 %d bodov.\n
trainingDefence=Tvoj level obrany je %d a \u010fal\u0161\u00ed level \u0165a bude st\u00e1\u0165 %d bodov.\n
trainingReflexes=Tvoje reflexy s\u00fa na \u00farovni %d a \u010fal\u0161\u00ed level \u0165a bude st\u00e1\u0165 %d bodov.\n
trainingStrength=Tvoja sila je na \u00farovni %d a \u010fal\u0161\u00ed level \u0165a bude st\u00e1\u0165 %d bodov.\n
trainingHP=Maximum tvojho \u017eivota je %d a zv\u00fd\u0161i\u0165 ho m\u00f4\u017ee\u0161 za %d bodov.\n
trainingPrompt=\u010co chce\u0161 robi\u0165 teraz?
trainingUpgrade=Tvoje schopnosti boli \u00faspe\u0161ne vylep\u0161en\u00e9!
trainingNotEnoughXP=Na toto nem\u00e1\u0161 dostatok bodov sk\u00fasenost\u00ed!
inputOptions=Tvoje mo\u017enosti s\u00fa: %s.\n
inputInvalidCommand=Neplatn\u00e1 vo\u013eba!
punch=uder
slap=facka
stab=bodnutie
slash=seknutie
throwWeapon=hod zbrane
paperN=Papierov\u00fd \u0161t\u00edt
paperC=papier
paperD=Je to papier. Ne\u010dakaj \u017eiadnu pomoc pri obrane, ale aspo\u0148 m\u00e1 tvar ako \u0161t\u00edt!
cartonN=Kart\u00f3n
cartonC=karton
cartonD=\u013dahk\u00e9 brnenie, ktor\u00e9 \u0165a do istej miery vie ochr\u00e1ni\u0165. Ale nezab\u00fadaj na t\u00fa \u00fa\u017easn\u00fa hmotnos\u0165!
shieldN=Dreven\u00fd \u0161t\u00edt
shieldC=stit
shieldD=Dreven\u00fd \u0161t\u00edt je slu\u0161n\u00fd n\u00e1stroj. Nie je to to najlep\u0161ie, ale m\u00f4\u017ee si ho dovoli\u0165 takmer ka\u017ed\u00fd.
ironN=\u017delezn\u00e9 brnenie
ironC=zelezo
ironD=\u0164a\u017ek\u00e9 brnenie, s ktor\u00fdm sa stane\u0161 nesmrte\u013en\u00fdm. V tomto brnen\u00ed tvoj hrdina nikdy nezomrie...teda, a\u017e k\u00fdm nezomrie.
steelN=Oce\u013eov\u00e9 brnenie
steelC=ocel
steelD=Silnej\u0161ia a \u013eah\u0161ia verzia \u017eelezn\u00e9ho brnenia. Toto je vo\u013eba ozajstn\u00fdch bojovn\u00edkov!
handsN=Hol\u00e9 ruky
handsC=ruky
handsD=Tvoje vlastn\u00e9 ruky...ber, alebo nechaj tak.
toothpickN=Dreven\u00e9 \u0161p\u00e1ratko
toothpickC=sparatko
toothpickD=Tvrd\u00e9 dreven\u00e9 \u0161p\u00e1radlo ru\u010dne vyroben\u00e9 zlat\u00fdmi ru\u010di\u010dkami sovietsk\u00fdch pracovn\u00edkov niekde na Sib\u00edri.
arrowN=\u0160\u00edp...bez luku
arrowC=sip
arrowD=Na\u010do je komu luk? Seknutie, bodnutie, alebo hod? V\u017edy smrte\u013en\u00e9. V\u00fdborn\u00e1 vo\u013eba!
anvilN=Podkova
anvilC=podkova
anvilD=\u017delezo je v\u017edy bolestiv\u00e9. Boxer v tvare podkovy? T\u00fdm nechce schyta\u0165 naozaj nikto. Au!
hammerN=Geologick\u00e9 kladivko
hammerC=kladivko
hammerD=Toto mo\u017eno nie je naj\u013eah\u0161ia zbra\u0148, ktor\u00e1 bola kedy vyroben\u00e1. P\u00f4vodne zbra\u0148 Vikingov, teraz v XS ve\u013ekosti pre be\u017en\u00fdch smrte\u013en\u00edkov.
spearN=Zlomen\u00fd o\u0161tep
spearC=ostep
spearD=Je to v podstate len palica. Ale s trochou predstavivosti sprav\u00ed tvojho hrdinu neporazite\u013en\u00fdm!
boomerangN=Bumerang
boomerangC=bumerang
boomerangD=Dobr\u00fd kamar\u00e1t sa v\u017edy vr\u00e1ti, nie? Rovnako, ako bumerang. Naprd sekanie, e\u0161te hor\u0161ie bodanie, ale m\u00f4\u017ee\u0161 ho h\u00e1dza\u0165 nekone\u010dne ve\u013ea r\u00e1z. Predstav si mo\u017enosti, ktor\u00ed ti to d\u00e1va...
spoonN=Ly\u017eica tvojej mamky
spoonC=lyzica
spoonD=S t\u00fdmto nechce ma\u0165 do \u010dinenia nik. Niektor\u00ed s\u00faperi zutekaj\u00fa u\u017e len pri poh\u013eade na tvoju zbra\u0148 hromadn\u00e9ho ni\u010denia. Pou\u017e\u00edvaj s rozvahou, m\u00f4\u017ee\u0161 sp\u00f4sobi\u0165 \u0165a\u017ek\u00e9 zranenia!